Simsoniteee/TestRepo/F2873x_epwm/device/driverlib/inc/hw_clbxbar.h
//*****************************************************************************
//
// The following are defines for the bit fields in the AUXSIGOUTINV register
//
//*****************************************************************************
#define XBAR_AUXSIGOUTINV_OUT0    0x1U         // Selects polarity for AUXSIG0
                                               // of CLB-XBAR
#define XBAR_AUXSIGOUTINV_OUT1    0x2U         // Selects polarity for AUXSIG1
                                               // of CLB-XBAR
#define XBAR_AUXSIGOUTINV_OUT2    0x4U         // Selects polarity for AUXSIG2
                                               // of CLB-XBAR
#define XBAR_AUXSIGOUTINV_OUT3    0x8U         // Selects polarity for AUXSIG3
                                               // of CLB-XBAR
#define XBAR_AUXSIGOUTINV_OUT4    0x10U        // Selects polarity for AUXSIG4
                                               // of CLB-XBAR
#define XBAR_AUXSIGOUTINV_OUT5    0x20U        // Selects polarity for AUXSIG5
                                               // of CLB-XBAR
#define XBAR_AUXSIGOUTINV_OUT6    0x40U        // Selects polarity for AUXSIG6
                                               // of CLB-XBAR
#define XBAR_AUXSIGOUTINV_OUT7    0x80U        // Selects polarity for AUXSIG7
                                               // of CLB-XBAR

//*****************************************************************************
//
// The following are defines for the bit fields in the AUXSIGLOCK register
//
//*****************************************************************************
#define XBAR_AUXSIGLOCK_LOCK      0x1U         // Locks the configuration for
                                               // CLB-XBAR
#define XBAR_AUXSIGLOCK_KEY_S     16U
#define XBAR_AUXSIGLOCK_KEY_M     0xFFFF0000U  // Write Protection KEY
#endif
